tutorials/incompressible/pimpleDyMFoam/movingCylinders/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="pimpleDyMFoam"

runApplication blockMesh
runApplication setSet -batch setBatchGgi
\rm -f log.setSet
runApplication setSet -batch setBatchMotion

\rm -rf constant/polyMesh/sets/*_old*
runApplication setsToZones

\rm -rf constant/polyMesh/sets/

runApplication $application
